/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   minishell.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ppipes <ppipes@student.21-school.ru>       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/11/19 01:02:28 by ppipes            #+#    #+#             */
/*   Updated: 2020/11/19 13:09:30 by ppipes           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "minishell.h"

int main(void)
{
	char *line;
	t_args args; // это отправим в парсер

	while (1)
	{
		write(1, "чего тебе, кожаный мешок?> ", 47); // приглашение ввода
		get_next_line(0, &line); // считываем строку из stdin
		// parse_line(&args, line); // тут будет парсер
		// execute_command(&args);	// сюда структура должна попасть уже заполненной
		printf("READ THIS: %s\n", line); // распечатаем что мы считали
		free(line);
	}
	return (0);
}